Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs.Options
User's options associated with the synchronization operation.
Since:
2010

Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs.Comments
User's comments for synchronization.
Since:
2010

Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs.Location
Full path of the central model which is to be synchronized.
Since:
2010

Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs
The event arguments used by the DocumentSynchronizingWithCentralEventArgs event.
Since:
2010